
books = [# Создаём список из 5 словарей
    {
        "title": "Война и мир",#К каждой книге использую ключ
        "author": "Лев Толстой",
        "year": 1869
    },
    {
        "title": "Дом в котором",
        "author": "Мариам Петросян",
        "year": 2009
    },
    {
        "title": "Мастер и Маргарита",
        "author": "Михаил Булгаков",
        "year": 1966
    },
    {
        "title": "Преступление и наказание",
        "author": "Фёдор Достоевский",
        "year": 1866
    },
    {
        "title": "Обломов",
        "author": "Иван Гончаров",
        "year": 1859
    }
]


for index, book in enumerate(books, start=1):# Прохожу по всем книгам 

    print(f"---------------------- Книга {index} -----------------------")# вывожу информацию
    print(f"Название: {book['title']}, Автор: {book['author']},")
    print(f"-------------------------{book['year']}-------------------------\n")
